In [140]:
# import libraries
import pandas as pd
import datetime as dt
import pandas_datareader.data as web

In [143]:

def oecd_data_to_df(name, data_source, start_time, end_time):
    df_raw = web.DataReader(name, source, start_time, end_time)
    return df_raw

def shaping_data(df_raw):
    levels = sample_data.columns.names
    df = sample_data.stack(level=levels).reset_index()
    df.rename(columns = {0:'population'}, inplace = True)
    return df

In [146]:
# pulling raw data
start_time = dt.datetime(1990, 1, 1)
end_time = dt.datetime(2021, 12, 31)
df_raw = oecd_data_to_df('HISTPOP', 'oecd', start_time, end_time)

df_raw = shaping_data(df_raw)

# filtering data - removing aggregate rows
sex = ['Men', 'Women']
age = ['0 to 4','5 to 9','10 to 14','15 to 19',	'20 to 24',	'25 to 29',	'30 to 34','35 to 39','40 to 44','45 to 49','50 to 54','55 to 59','60 to 64','65 to 69','70 to 74','75 to 79','80 to 84','85 and over'
]

df_raw = df_raw.loc[(df_raw['Sex'].isin(sex))& (df_raw['Age'].isin(age))]
# df_raw.set_index(['Time', 'Country', 'Sex', 'Age'], inplace = True)

In [149]:
df_raw.reset_index(inplace=True)
df_raw.head()

        Time    Country  Sex       Age  population
0 1990-01-01  Argentina  Men    0 to 4   1725576.0
1 1990-01-01  Argentina  Men  10 to 14   1688890.0
2 1990-01-01  Argentina  Men  15 to 19   1415238.0
3 1990-01-01  Argentina  Men  20 to 24   1242906.0
4 1990-01-01  Argentina  Men  25 to 29   1167355.0